# suppress inspection "UnusedProperty" for whole file

# region distribution
block.esoterum-wire.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u043f\u0440\u043e\u0432\u043e\u0434
block.esoterum-wire.description = \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u043f\u0440\u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0435 \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0417\u0430\u0431\u0438\u0440\u0430\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435, \u0432\u044b\u0434\u0430\u0451\u0442 \u043d\u0430 \u0432\u044b\u0432\u043e\u0434\u0435.

block.esoterum-junction.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u043f\u0435\u0440\u0435\u043a\u0440\u0451\u0441\u0442\u043e\u043a
block.esoterum-junction.description = \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u043f\u0440\u0438 \u043f\u043b\u0430\u043d\u0438\u0440\u043e\u0432\u043a\u0435 \u043f\u0440\u043e\u0432\u043e\u0434\u043a\u0438, \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u043f\u0440\u043e\u0432\u043e\u0434\u0430\u043c \u043f\u0435\u0440\u0435\u0441\u0435\u043a\u0430\u0442\u044c\u0441\u044f \u0438 \u043d\u0435 \u0432\u044b\u0437\u044b\u0432\u0430\u0442\u044c \u043f\u043e\u043c\u0435\u0445 \u0432 \u0440\u0430\u0431\u043e\u0442\u0435 \u0434\u0440\u0443\u0433-\u0434\u0440\u0443\u0433\u0430.

block.esoterum-router.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u043c\u0430\u0440\u0448\u0440\u0443\u0442\u0438\u0437\u0430\u0442\u043e\u0440
block.esoterum-router.description = \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b.

block.esoterum-node.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u0443\u0437\u0435\u043b
block.esoterum-node.description = \u041f\u0440\u043e\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043a \u0441\u043e\u043f\u0440\u044f\u0436\u0451\u043d\u043d\u043e\u043c\u0443 \u0443\u0437\u043b\u0443 \u043d\u0430 \u0440\u0430\u0441\u0441\u0442\u043e\u044f\u043d\u0438\u0438, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0432\u044b\u0434\u0430\u0451\u0442 \u0435\u0433\u043e \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b.

block.esoterum-latch.name = \u042f\u0447\u0435\u0439\u043a\u0430 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438
block.esoterum-latch.description = \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0441\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u0438\u044f \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0415\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0445\u043e\u0434\u0435 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d, \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u043f\u0440\u0430\u0432\u0430/\u0441\u043b\u0435\u0432\u0430 \u0431\u0443\u0434\u0435\u0442 \u0441\u043e\u0445\u0440\u0430\u043d\u0451\u043d.

block.esoterum-controller.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u0430\u044f \u0437\u0430\u0433\u043b\u0443\u0448\u043a\u0430
block.esoterum-controller.description = \u041a\u0430\u0436\u0434\u0430\u044f \u0441\u0442\u043e\u0440\u043e\u043d\u0430 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d\u0430 \u043a\u0430\u043a \u0432\u0432\u043e\u0434-\u0432\u044b\u0432\u043e\u0434.
block.esoterum-buffer.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u0431\u0443\u0444\u0435\u0440
block.esoterum-buffer.description = \u0412\u043a\u043b\u044e\u0447\u0430\u0435\u0442\u0441\u044f \u0438 \u0432\u044b\u043a\u043b\u044e\u0447\u0430\u0435\u0442\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0451\u043d\u043d\u044b\u0435 \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043a\u0438 \u0432\u0440\u0435\u043c\u0435\u043d\u0438.

block.esoterum-rest-buffer.name = \u041b\u0435\u043d\u0438\u0432\u044b\u0439 \u0431\u0443\u0444\u0435\u0440
block.esoterum-rest-buffer.description = \u0412\u043a\u043b\u044e\u0447\u0430\u0435\u0442\u0441\u044f \u0438 \u0432\u044b\u043a\u043b\u044e\u0447\u0430\u0435\u0442\u0441\u044f \u0447\u0435\u0440\u0435\u0437 \u043d\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u043c\u044b\u0435 \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043a\u0438 \u0432\u0440\u0435\u043c\u0435\u043d\u0438.
# endregion distribution

# region sources
block.esoterum-switch.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u043f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0430\u0442\u0435\u043b\u044c
block.esoterum-switch.description = \u041f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e \u0432\u044b\u0434\u0430\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043f\u0440\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0438, \u043d\u0430\u0436\u0430\u0442\u044c \u0434\u043b\u044f \u043f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f \u0440\u0435\u0436\u0438\u043c\u043e\u0432.

block.esoterum-button.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u0430\u044f \u043a\u043d\u043e\u043f\u043a\u0430
block.esoterum-button.description = \u0412\u044b\u0434\u0430\u0451\u0442 \u043a\u043e\u0440\u043e\u0442\u043a\u0438\u0439 \u0441\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u0438\u043c\u043f\u0443\u043b\u044c\u0441 \u043f\u0440\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0438.

block.esoterum-clock.name = \u0421\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0435 \u0447\u0430\u0441\u044b
block.esoterum-clock.description = \u0412\u044b\u0434\u0430\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432 \u0442\u0435\u0447\u0435\u043d\u0438\u0438 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u043d\u043e\u0433\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0438 \u0447\u0435\u0440\u0435\u0437 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0451\u043d\u043d\u044b\u0435 \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043a\u0438. \u041d\u0430\u0436\u0430\u0442\u044c \u0434\u043b\u044f \u043d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0438.
# endregion sources

# region logic gates
block.esoterum-AND.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0418
block.esoterum-AND.description = \u0412\u044b\u0434\u0430\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b, \u0435\u0441\u043b\u0438 \u043e\u0431\u0430 \u0432\u0432\u043e\u0434\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u044c\u043d\u044b.

block.esoterum-XOR.name = \u0418\u0441\u043a\u043b\u044e\u0447\u0430\u044e\u0449\u0435\u0435 \u0418\u041b\u0418
block.esoterum-XOR.description = \u0412\u044b\u0434\u0430\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b, \u0435\u0441\u043b\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u043e\u0434\u0438\u043d \u0432\u0432\u043e\u0434 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.

block.esoterum-NOT.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u041d\u0415
block.esoterum-NOT.description = \u0418\u043d\u0432\u0435\u0440\u0442\u0438\u0440\u0443\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435 \u0438 \u0432\u044b\u0434\u0430\u0451\u0442 \u043d\u0430 \u0432\u044b\u0432\u043e\u0434\u0435.
# endregion logic gates

# region logic outputs
block.esoterum-note-block.name = \u041d\u043e\u0442\u043d\u044b\u0439 \u0431\u043b\u043e\u043a
block.esoterum-note-block.description = \u041f\u0440\u043e\u0438\u0433\u0440\u044b\u0432\u0430\u0435\u0442 \u043d\u043e\u0442\u0443 \u043f\u0440\u0438 \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u0438\u0438 \u0441\u0438\u0433\u043d\u0430\u043b\u0430.
block.esoterum-note-block.details = \u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043d\u0430\u0439\u0434\u0438 \u043f\u0435\u0441\u043d\u044e "\u0412\u0435\u0441\u0435\u043b\u043e \u043f\u043e \u043f\u043e\u043b\u044e \u043f\u0440\u044b\u0433\u0430\u0435\u0442 \u043a\u0430\u0431\u0430\u043d\u0447\u0438\u043a"!
# endregion logic outputs

block.esoterum-manual.name = \u0418\u043d\u0441\u0442\u0440\u0443\u043a\u0446\u0438\u044f \u0438\u043d\u0436\u0435\u043d\u0435\u0440\u0430
block.esoterum-manual.description = \u0412\u0441\u0451, \u0447\u0442\u043e \u043d\u0443\u0436\u043d\u043e \u0437\u043d\u0430\u0442\u044c \u043e \u043f\u0440\u043e\u0432\u043e\u0434\u0430\u0445. \u041a\u0430\u043a \u0432\u043e\u0434\u0438\u0442\u0441\u044f, \u0432\u0441\u0451 \u043d\u0430 \u0442\u0430\u0442\u0430\u0440\u0441\u043a\u043e\u043c.
block.esoterum-manual.details = "\u0421\u0438\u043d\u0434\u0437\u0438, \u0437\u0430\u043b\u0435\u0437\u044c \u0432 \u0433\u0440\u0451\u0431\u0430\u043d\u043d\u0443\u044e \u0438\u043d\u0441\u0442\u0440\u0443\u043a\u0446\u0438\u044e!" 
